Core/src/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоррСтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПартия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСпецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПродажи</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.СписаниеЗапасов</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.СписаниеТопливаЗапасов</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПересортицаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВРозницуСуммовойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Резервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <comment>- устаревшее измерение - не заполнять</comment>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаЗатратРегл</name>
    <comment>- устаревшее измерение - не заполнять</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyКонтрагенты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПартииНоменклатуры</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПоступления</name>
    <comment>ONESOFT-3602</comment>
    <type>
      <types>DefinedType.ДокументПоступленияДляFIFO</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/AccumulationRegisters/Запасы/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [25 октября 2021]  НАЧАЛО
	Если НЕ ОбменДанными.Загрузка И ЭтотОбъект.Количество() Тогда
	
		Регистратор = Отбор.Регистратор.Значение;
		УчетСебестоимостиВРазрезеОрганизации = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(Регистратор.Дата, Новый Структура("Организация", Регистратор.Организация)).УчетСебестоимостиВРазрезеОрганизации;
		Если УчетСебестоимостиВРазрезеОрганизации Тогда
		
			Для каждого ТекЗапись Из ЭтотОбъект Цикл
				
				Если ТипЗнч(ТекЗапись.СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
					И ТекЗапись.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад
					Тогда
					
					ТекЗапись.СтруктурнаяЕдиница = Неопределено;
					
				КонецЕсли; 	
				Если ТипЗнч(ТекЗапись.КоррСтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
					И ТекЗапись.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад
					Тогда
					
					ТекЗапись.КоррСтруктурнаяЕдиница = Неопределено;
					
				КонецЕсли; 	
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		//Малышев 2024-06-18 ONESOFT-3242 (--
		//Оприходование запасов и списание запасов
		//в етих документах надо очистить счет затрат регл
		//Расходная накладная
		//операция продажа
		//Вазврат Покупателю - точе расходная накладная
		//кроме произвотство 


		ЗаполнятьКолонку_СчетУчетаЗатратРегл = Ложь;		
		ОчищатьКолонку_СчетУчетаЗатратРегл = Ложь;	
		
		Если
			ТипЗнч(Регистратор) <> Тип("ДокументСсылка.СборкаЗапасов") 
			//ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОприходованиеЗапасов") 
			//ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.СписаниеЗапасов") 
			//ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.РасходнаяНакладная") 
			//ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗаказПокупателя")
			Тогда
			
			ОчищатьКолонку_СчетУчетаЗатратРегл = Истина;
			
		КонецЕсли;	
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.РезервированиеЗапасов") И (Регистратор.ПереходНаНовыйФункционал) Тогда
			ОчищатьКолонку_СчетУчетаЗатратРегл = ЛОЖЬ;
		КонецЕсли;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления	
				
		Если (ЗаполнятьКолонку_СчетУчетаЗатратРегл или ОчищатьКолонку_СчетУчетаЗатратРегл) 
			  
			Тогда
			
			ТабДвижений = ЭтотОбъект.Выгрузить();
			ТабДвижений.Сортировать("НомерСтроки");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(Т.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	Т.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
			|	Т.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ ТабДвижений
			|ИЗ
			|	&ТабДвижений КАК Т
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабДвижений.НомерСтроки КАК НомерСтроки,
			|	ТабДвижений.Номенклатура КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА &ЗаполнятьКолонку_СчетУчетаЗатратРегл
			|			ТОГДА ВЫБОР
			|					КОГДА ТабДвижений.СчетУчетаЗатратРегл <> ТабДвижений.Номенклатура.СчетУчетаЗатратРегл
			|						ТОГДА ТабДвижений.Номенклатура.СчетУчетаЗатратРегл
			|					ИНАЧЕ ТабДвижений.СчетУчетаЗатратРегл
			|				КОНЕЦ
			|		КОГДА &ОчищатьКолонку_СчетУчетаЗатратРегл
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
			|		ИНАЧЕ ТабДвижений.СчетУчетаЗатратРегл
			|	КОНЕЦ КАК СчетУчетаЗатратРегл
			|ИЗ
			|	ТабДвижений КАК ТабДвижений
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			|		ПО (ТабДвижений.Номенклатура = ТабДвижений.Номенклатура.Ссылка)  
			//+ lazare 12.07.2024 ONESOFT-3323 
			|
			|СГРУППИРОВАТЬ ПО
			|	ТабДвижений.НомерСтроки,
			|	ТабДвижений.Номенклатура,
			|	ВЫБОР
			|		КОГДА &ЗаполнятьКолонку_СчетУчетаЗатратРегл
			|			ТОГДА ВЫБОР
			|					КОГДА ТабДвижений.СчетУчетаЗатратРегл <> ТабДвижений.Номенклатура.СчетУчетаЗатратРегл
			|						ТОГДА ТабДвижений.Номенклатура.СчетУчетаЗатратРегл
			|					ИНАЧЕ ТабДвижений.СчетУчетаЗатратРегл
			|				КОНЕЦ
			|		КОГДА &ОчищатьКолонку_СчетУчетаЗатратРегл
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
			|		ИНАЧЕ ТабДвижений.СчетУчетаЗатратРегл
			|	КОНЕЦ   
			//+ lazare 12.07.2024 ONESOFT-3323
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.УстановитьПараметр("ТабДвижений", ТабДвижений);
			Запрос.УстановитьПараметр("ЗаполнятьКолонку_СчетУчетаЗатратРегл", ЗаполнятьКолонку_СчетУчетаЗатратРегл);
			Запрос.УстановитьПараметр("ОчищатьКолонку_СчетУчетаЗатратРегл", ОчищатьКолонку_СчетУчетаЗатратРегл);
			ТаблицаКолонокСчетовУчетаЗатратРегл = Запрос.Выполнить().Выгрузить();
			ТабДвижений.ЗагрузитьКолонку(ТаблицаКолонокСчетовУчетаЗатратРегл.ВыгрузитьКолонку("СчетУчетаЗатратРегл"),"СчетУчетаЗатратРегл");
			
			ЭтотОбъект.Загрузить(ТабДвижений);
			
		КонецЕсли;
		//Малышев 2024-06-18 ONESOFT-3242 --)
		
		
	
	КонецЕсли; 	
	// © Шишка В.В. [25 октября 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Запасы.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияЗапасыИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияЗапасыИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение Тогда
		
		// Если временная таблица "ДвиженияЗапасыИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияЗапасыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Запасы.НомерСтроки КАК НомерСтроки,
		|	Запасы.Организация КАК Организация,
		|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Запасы.СчетУчета КАК СчетУчета,
		|	Запасы.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Партия КАК Партия,
		|	Запасы.Проект КАК Проект,  //Малышев 2024-06-11 ONESOFT-3094
		|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВЫБОР
		|		КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Запасы.Количество
		|		ИНАЧЕ -Запасы.Количество
		|	КОНЕЦ КАК КоличествоПередЗаписью,
		|	ВЫБОР
		|		КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Запасы.Сумма
		|		ИНАЧЕ -Запасы.Сумма
		|	КОНЕЦ КАК СуммаПередЗаписью
		|ПОМЕСТИТЬ ДвиженияЗапасыПередЗаписью
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.Регистратор = &Регистратор
		|	И Запасы.сумма <> 0   //Малышев 2024-06-20 ONESOFT-3094
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		// Если временная таблица "ДвиженияЗапасыИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются во временную таблцу "ДвиженияЗапасыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыИзменение.Организация КАК Организация,
		|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчета,
		|	ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
		|	ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		|	ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		|	ДвиженияЗапасыИзменение.Партия КАК Партия,
		|	ДвиженияЗапасыИзменение.Проект КАК Проект,   //Малышев 2024-06-11 ONESOFT-3094
		|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ДвиженияЗапасыИзменение.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
		|	ДвиженияЗапасыИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью
		|ПОМЕСТИТЬ ДвиженияЗапасыПередЗаписью
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Запасы.НомерСтроки,
		|	Запасы.Организация,
		|	Запасы.СтруктурнаяЕдиница,
		|	Запасы.СчетУчета,
		|	Запасы.СчетУчетаРегл, //+++ Дмгг
		|	Запасы.Номенклатура,
		|	Запасы.Характеристика,
		|	Запасы.Партия,
		|	Запасы.Проект,  //Малышев 2024-06-11 ONESOFT-3094
		|	Запасы.ЗаказПокупателя,
		|	ВЫБОР
		|		КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Запасы.Количество
		|		ИНАЧЕ -Запасы.Количество
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Запасы.Сумма
		|		ИНАЧЕ -Запасы.Сумма
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияЗапасыИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияЗапасыИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияЗапасыИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияЗапасыИзменение");
	
	КонецЕсли;
	
	// Хозяйственная операция
	ХозяйственныеОперацииСервер.ЗаполнитьХозяйственнуюОперациюВНабореЗаписей(ЭтотОбъект);
	// Конец Хозяйственная операция
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияЗапасыИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияЗапасыИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияЗапасыИзменение.Организация КАК Организация,
	|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчета,
	|	ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|	ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
	|	ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
	|	ДвиженияЗапасыИзменение.Партия КАК Партия,
	|	ДвиженияЗапасыИзменение.Проект КАК Проект, //Малышев 2024-06-11 ONESOFT-3094
	|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ДвиженияЗапасыИзменение.КоличествоПередЗаписью) КАК КоличествоПередЗаписью,
	|	СУММА(ДвиженияЗапасыИзменение.КоличествоИзменение) КАК КоличествоИзменение,
	|	СУММА(ДвиженияЗапасыИзменение.КоличествоПриЗаписи) КАК КоличествоПриЗаписи,
	|	СУММА(ДвиженияЗапасыИзменение.СуммаПередЗаписью) КАК СуммаПередЗаписью,
	|	СУММА(ДвиженияЗапасыИзменение.СуммаИзменение) КАК СуммаИзменение,
	|	СУММА(ДвиженияЗапасыИзменение.СуммаПриЗаписи) КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияЗапасыИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияЗапасыПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияЗапасыПередЗаписью.Организация КАК Организация,
	|		ДвиженияЗапасыПередЗаписью.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ДвиженияЗапасыПередЗаписью.СчетУчета КАК СчетУчета,
	|		ДвиженияЗапасыПередЗаписью.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|		ДвиженияЗапасыПередЗаписью.Номенклатура КАК Номенклатура,
	|		ДвиженияЗапасыПередЗаписью.Характеристика КАК Характеристика,
	|		ДвиженияЗапасыПередЗаписью.Партия КАК Партия,
	|		ДвиженияЗапасыПередЗаписью.Проект КАК Проект, //Малышев 2024-06-11 ONESOFT-3094
	|		ДвиженияЗапасыПередЗаписью.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ДвиженияЗапасыПередЗаписью.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
	|		ДвиженияЗапасыПередЗаписью.КоличествоПередЗаписью КАК КоличествоИзменение,
	|		0 КАК КоличествоПриЗаписи,
	|		ДвиженияЗапасыПередЗаписью.СуммаПередЗаписью КАК СуммаПередЗаписью,
	|		ДвиженияЗапасыПередЗаписью.СуммаПередЗаписью КАК СуммаИзменение,
	|		0 КАК СуммаПриЗаписи
	|	ИЗ
	|		ДвиженияЗапасыПередЗаписью КАК ДвиженияЗапасыПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияЗапасыПриЗаписи.НомерСтроки,
	|		ДвиженияЗапасыПриЗаписи.Организация,
	|		ДвиженияЗапасыПриЗаписи.СтруктурнаяЕдиница,
	|		ДвиженияЗапасыПриЗаписи.СчетУчета,
	|		ДвиженияЗапасыПриЗаписи.СчетУчетаРегл, //--- Дмгг
	|		ДвиженияЗапасыПриЗаписи.Номенклатура,
	|		ДвиженияЗапасыПриЗаписи.Характеристика,
	|		ДвиженияЗапасыПриЗаписи.Партия,
	|		ДвиженияЗапасыПриЗаписи.Проект,  //Малышев 2024-06-11 ONESOFT-3094
	|		ДвиженияЗапасыПриЗаписи.ЗаказПокупателя,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияЗапасыПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияЗапасыПриЗаписи.Количество
	|			ИНАЧЕ ДвиженияЗапасыПриЗаписи.Количество
	|		КОНЕЦ,
	|		ДвиженияЗапасыПриЗаписи.Количество,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияЗапасыПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияЗапасыПриЗаписи.Сумма
	|			ИНАЧЕ ДвиженияЗапасыПриЗаписи.Сумма
	|		КОНЕЦ,
	|		ДвиженияЗапасыПриЗаписи.Сумма
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияЗапасыПриЗаписи
	|	ГДЕ
	|		ДвиженияЗапасыПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияЗапасыИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияЗапасыИзменение.Организация,
	|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница,
	|	ДвиженияЗапасыИзменение.СчетУчета,
	|	ДвиженияЗапасыИзменение.СчетУчетаРегл, //+++ Дмгг
	|	ДвиженияЗапасыИзменение.Номенклатура,
	|	ДвиженияЗапасыИзменение.Характеристика,
	|	ДвиженияЗапасыИзменение.Партия,
	|	ДвиженияЗапасыИзменение.Проект,  //Малышев 2024-06-11 ONESOFT-3094
	|	ДвиженияЗапасыИзменение.ЗаказПокупателя
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДвиженияЗапасыИзменение.КоличествоИзменение) <> 0
	|		ИЛИ СУММА(ДвиженияЗапасыИзменение.СуммаИзменение) <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	СчетУчетаРегл, //Малышев 2024-06-11 ONESOFT-3094
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект, //Малышев 2024-06-11 ONESOFT-3094
	|	ЗаказПокупателя");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияЗапасыИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияЗапасыИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	СтруктураВременныеТаблицы.Вставить("ДвиженияЗапасыИзменение", Истина); //Малышев 2024-06-20 ONESOFT-3094
	
	// Временная таблица "ДвиженияЗапасыПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияЗапасыПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#КонецЕсли
